# GetLevelIdsInRange Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadBoundaryLineData..::..GetLevelIdsInRange Method
AreaBasedLoadBoundaryLineData Class See Also
---
Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ISet<ElementId> GetLevelIdsInRange()
```

Visual Basic
---
```text
Public Function GetLevelIdsInRange As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetLevelIdsInRange()
```

# ### Return Value
The level ids between the top level and the bottom level (including the top level and the bottom level).
# See Also
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace